УТ_для_edt/src/InformationRegisters/смартОписанияДляПретензий/смартОписанияДляПретензий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартОписанияДляПретензий</name>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/смартОписанияДляПретензий/Forms/ФормаЗаписи/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ЗаписьПослеВопроса;  

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//++ #3978 смарт: Тимофеева 08.08.2025 / Печать сопроводительных документов. Замена печатных форм
	ЗаполнитьСписокДоступныхВалют();
	Элементы.Валюта.СписокВыбора.Очистить();
	Элементы.Валюта.СписокВыбора.ЗагрузитьЗначения(СписокВалют.ВыгрузитьЗначения());
	Если Параметры.Ключ.Пустой() Тогда
		Запись.Валюта = ВалютаПоУмолчанию();
	КонецЕсли; 
	СимволВалюты = ПолучитьСимвол(СписокВалют, Запись.Валюта);
	//-- #3978 смарт: Тимофеева 08.08.2025

КонецПроцедуры // ПриСозданииНаСервере

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НЕ ЗначениеЗаполнено(Запись.Цена) И НЕ ЗаписьПослеВопроса Тогда
		Отказ = Истина;
		Оповещение = Новый ОписаниеОповещения("ВопросПередЗаписьюЗавершение", ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'Сохранить и закрыть без цены?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийИЭлементовФормы

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	НоменклатураУжеЕсть = ПроверитьНаличиеЗаписиПоНоменклатуре(Запись.Номенклатура);
	
	Если НоменклатураУжеЕсть Тогда
		ПоказатьПредупреждение(, "По номенклатуре " + Запись.Номенклатура + " уже есть запись");
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	//++ #3978 смарт: Тимофеева 08.08.2025 / Печать сопроводительных документов. Замена печатных форм
	СимволВалюты = ПолучитьСимвол(СписокВалют, Запись.Валюта);  
	//-- #3978 смарт: Тимофеева 08.08.2025
КонецПроцедуры // ВалютаПриИзменении 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВопросПередЗаписьюЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда	
		
		ЗаписьПослеВопроса = Истина;
		Записать();
		Закрыть();
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьНаличиеЗаписиПоНоменклатуре(Номенклатура)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	|	смартОписанияДляПретензий.Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрСведений.смартОписанияДляПретензий КАК смартОписанияДляПретензий
	|ГДЕ
	|	смартОписанияДляПретензий.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();

КонецФункции

//++ #3978 смарт: Тимофеева 08.08.2025 / Печать сопроводительных документов. Замена печатных форм

&НаСервере
Процедура ЗаполнитьСписокДоступныхВалют()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Валюты.Ссылка КАК Ссылка,
	|	""$"" КАК Символ
	|ИЗ
	|	Справочник.Валюты КАК Валюты
	|ГДЕ
	|	Валюты.Код = ""840"" 
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Валюты.Ссылка,
	|	""€""
	|ИЗ
	|	Справочник.Валюты КАК Валюты
	|ГДЕ
	|	Валюты.Код = ""978"" 
    |
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Валюты.Ссылка,
	|	""¥""
	|ИЗ
	|	Справочник.Валюты КАК Валюты
	|ГДЕ
	|	Валюты.Код = ""156""
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Валюты.Ссылка,
	|	""₽""
	|ИЗ
	|	Справочник.Валюты КАК Валюты
	|ГДЕ
	|	Валюты.Код = ""643""
	|";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокВалют.Добавить(Выборка.Ссылка, Выборка.Символ);
	КонецЦикла; // Пока Выборка.Следующий() Цикл
КонецПроцедуры // ПолучитьМассивДоступныхВалют

&НаСервере
Функция ВалютаПоУмолчанию()
	Возврат Справочники.Валюты.НайтиПоКоду("156");
КонецФункции // ПолучитьМассивДоступныхВалют

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьСимвол(СписокВалют, Валюта)
	Символ = "";
	ЭлементСписка = СписокВалют.НайтиПоЗначению(Валюта);
	Если НЕ ЭлементСписка = Неопределено Тогда
		Символ = ЭлементСписка.Представление;		
	КонецЕсли;
	Возврат Символ;
КонецФункции

//-- #3978 смарт: Тимофеева 08.08.2025

#КонецОбласти 

#Область Инициализация

ЗаписьПослеВопроса = Ложь;

#КонецОбласти
